<a href="https://colab.research.google.com/github/jugernaut/MACTI-manejodatos/blob/principal/BasesDeDatos/Consultas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## Ejemplos de querys

In [ ]:
#!pip install -U pandasql

In [ ]:
import pandas as pd
import numpy as np
from pandasql import sqldf

In [ ]:
# Create a dummy pd.Dataframe
df = pd.DataFrame({'col_1': ['A', 'B', np.NaN, 'C', 'D'], 'col_2': ['F', np.NaN, 'G', 'H', 'I']})

In [ ]:
df

  col_1 col_2
0     A     F
1     B   NaN
2   NaN     G
3     C     H
4     D     I

In [ ]:
query = """
SELECT *
FROM df
WHERE col_1 IS NOT NULL;
"""

# Run the query
df_view = sqldf(query)

In [ ]:
df_view

  col_1 col_2
0     A     F
1     B  None
2     C     H
3     D     I

In [ ]:
datos_0 = {
    'Nombre' : ['Juan', 'Laura', 'Pepe'],
    'Edad': [42, 40, 37],
    'id_empleado': [1, 2, 3]
}

datos_1 ={
        'id_dpto': [4, 5, 6],
        'Departamento': ['Comunicación', 'Administración', 'Ventas'],
        'ventas': [1000, 5000, 5230]
}

datos_2 ={
        'id_empleado': [1, 2, 3],
        'id_dpto': [4, 5, 6],
}


vendedores = pd.DataFrame(datos_0)
ventas = pd.DataFrame(datos_1)
referencias = pd.DataFrame(datos_2)

In [ ]:
vendedores

  Nombre  Edad  id_empleado
0   Juan    42            1
1  Laura    40            2
2   Pepe    37            3

In [ ]:
ventas

   id_dpto    Departamento  ventas
0        4    Comunicación    1000
1        5  Administración    5000
2        6          Ventas    5230

In [ ]:
referencias

   id_empleado  id_dpto
0            1        4
1            2        5
2            3        6

In [ ]:
q = '''
select *
from vendedores as v
join referencias as r
on v.id_empleado = r.id_empleado
'''

In [ ]:
sqldf(q)

  Nombre  Edad  id_empleado  id_empleado  id_dpto
0   Juan    42            1            1        4
1  Laura    40            2            2        5
2   Pepe    37            3            3        6

In [ ]:
q = '''
select *
from vendedores as v
join referencias as r
on v.id_empleado = r.id_empleado
join ventas as vt
on vt.id_dpto = r.id_dpto
'''

In [ ]:
sqldf(q)

,Nombre,Edad,id_empleado,id_empleado,id_dpto,id_dpto,Departamento,ventas
0,Juan,42,1,1,4,4,Comunicación,1000
1,Laura,40,2,2,5,5,Administración,5000
2,Pepe,37,3,3,6,6,Ventas,5230